# PipeFittingAndAccessoryPressureDropUIService Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalServices..::..BuiltInExternalServices..::..PipeFittingAndAccessoryPressureDropUIService Property
ExternalServices..::..BuiltInExternalServices Class See Also
---
The external service which permits registration of an alternate implementation for a pipe fitting and accessory pressure drop calculation UI. To use this service, programmers implement a server class that derives from IPipeFittingAndAccessoryPressureDropUIServer.
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ExternalServiceId PipeFittingAndAccessoryPressureDropUIService { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PipeFittingAndAccessoryPressureDropUIService As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
static property ExternalServiceId^ PipeFittingAndAccessoryPressureDropUIService {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalServices..::..BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace